// : 주석[설명] 코드실행x 메모
package Day01; // 1. 해당 파일이 위치한 폴더명 [ Main클래스는 Day01 폴더에 있어 ]
////////////////////////// 클래스 구역 start /////////////////////
public class Main { // 코드작성 시작 구역
    // * 코드를 입력하는 공간
        // ma 자동완성
            // main( JDK ) 함수( 미리 만들어진 코드 - 문법 -> 정리 )
    public static void main(String[] args) { // 코드를 읽고 실행 구역
        // console : 출력화면
            // 출력하는 방법 : sout + 자동완성
            // System.out.println("출력 하고 싶은말");
        System.out.println("자바 안녕22222 ");
    } // 코드 읽어주는 구역 끝
} // 코드작성 구역 끝
////////////////////////// 클래스 구역 end /////////////////////

/*
    컴퓨터 많이 쓴다. 4차 산업혁명
        이유 : 피로도 , 전기세 , 빠르다 , 거짓말  [ 쉽고 빠르게 대량 돈 ]

    세상존재하는 모든형태 ---------> 코드화[컴퓨터 이해]

        *붕어빵틀[ 클래스 : 설계도 : 미리 만들어진 구조 ]
        *붕어빵[ 객체 : 클래스/설계도/미리구조 기반 형태 ]

    객체지향 : 100%객체 ----> 100%클래스
        미리 설계도[클래스] 기반으로 만들어진 형태

 */













